#ifndef HAVE_ERR_QUIT
#define HAVE_ERR_QUIT
#include <stdarg.h>               /* заголовочный файл ANSI C */
#include <syslog.h>               /* для syslog()             */

/**************************************************************/
/* Нефатальная ошибка, связана с системным вызовом. Выводим   */
/* сообщение и возвращаем управление                          */
/**************************************************************/
void err_ret(const char *fmt, ...);

/**************************************************************/
/* Фатальная ошибка, связана с системным вызовом. Выводим     */
/* сообщение и завершаем работу                               */
/**************************************************************/
void err_sys(const char *fmt, ...);

/**************************************************************/
/* Фатальная ошибка, связаннная с системным вызовом. Выводит  */
/* сообщение, сохраняем дамп памяти процесса и заканчиваем    */
/* работу                                                     */
/**************************************************************/
void err_dump(const char *fmt, ...);

/**************************************************************/
/* Нефатальная ошибка, не относящиеся к системному вызову.    */
/* Выводим сообщение и возвращаем управление                  */
/**************************************************************/
void err_msg(const char *fmt, ...);

/**************************************************************/
/* Фатальная ошибка, не относящаяся к системному вызову.      */
/* ВЫводим сообщение заканчиваем работу                       */
/**************************************************************/
void err_quit(const char *fmt, ...);

#endif 
